### Lab 4 ðŸš¢Titanic Survivors

The purpose of this project is to find the result of executing (titanic.survived == 'no').describe()

In [1]:
import pandas as pd

In [3]:
# Load dataset into a dataframe
titanic = pd.read_csv('https://vincentarelbundock.github.io/Rdatasets/csv/carData/TitanicSurvival.csv')

In [5]:
pd.set_option('precision', 2) # format for floating-point values

In [6]:
# View the first five rows
titanic.head()

                        Unnamed: 0 survived     sex    age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female  29.00            1st
1   Allison, Master. Hudson Trevor      yes    male   0.92            1st
2     Allison, Miss. Helen Loraine       no  female   2.00            1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00            1st

In [8]:
titanic.columns = ['name', 'survived', 'sex', 'age', 'class']

titanic.head()

                              name survived     sex    age class
0    Allen, Miss. Elisabeth Walton      yes  female  29.00   1st
1   Allison, Master. Hudson Trevor      yes    male   0.92   1st
2     Allison, Miss. Helen Loraine       no  female   2.00   1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00   1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00   1st

In [9]:
# describe calculates these statistics only for the numeric columnsâ€”in this case, just the age column:
titanic.describe()

           age
count  1046.00
mean     29.88
std      14.41
min       0.17
25%      21.00
50%      28.00
75%      39.00
max      80.00

In [11]:
'''compare the survived column to 'no' to get a new Series containing True/False values, 
then use describe to summarize the results:'''
(titanic.survived == 'no').describe()

count     1309
unique       2
top       True
freq       809
Name: survived, dtype: object

- count is the total number of items in the result.
- unique is the number of unique values (2) in the resultâ€”True (died) and False (survived).
- top is the most frequently occurring value in the result.
- freq is the number of occurrences of the top value.